Configuration/3D/M5/constant/V
version https://git-lfs.github.com/spec/v1
oid sha256:3694d1a2ed0111a0dbfd587af0584ed6e6b951bf631b34c760f44e74c0176c51
size 78798393
